{
  "1": {
    "comments": [
      "A refreshing and healthy smoothie. Love the vibrant green color and the taste is amazing!",
      "Perfect balance of ingredients. The spinach and fruits make this smoothie both healthy and delicious.",
      "I start my day with this smoothie regularly. It's a great way to kickstart my morning!"
    ]
  },
  "2": {
    "comments": [
      "A delicious and nutritious bowl. The quinoa and chickpeas provide a satisfying meal.",
      "I love Buddha bowls, and this one is a favorite. The variety of veggies makes it colorful and tasty.",
      "Easy to make and so filling! This Buddha bowl has become a weekly meal in our home."
    ]
  },
  "3": {
    "comments": [
      "The lemon herb marinade makes the chicken so flavorful and juicy. A family favorite!",
      "I'm a fan of roasted chicken, and this recipe exceeded my expectations. The herbs really elevate the taste.",
      "The aroma while roasting is amazing! The chicken turns out tender and full of flavor."
    ]
  },
  "4": {
    "comments": [
      "As a vegetarian, I'm always looking for protein-rich meals. This lentil curry is perfect!",
      "The blend of spices in this lentil curry is spot on. It's become a go-to recipe for me.",
      "I love curry, and this vegetarian lentil curry is at the top of my list. Hearty and satisfying!"
    ]
  },
  "5": {
    "comments": [
      "Classic comfort food at its finest. Layers of pasta, meat, and cheese - what's not to love?",
      "This beef lasagna recipe is a hit with my family. It's a staple for Sunday dinners.",
      "A timeless favorite! The melted cheese on top makes it extra delicious."
    ]
  },
  "6": {
    "comments": [
      "Thai cuisine is a favorite, and this red curry with shrimp is exceptional. Spicy and aromatic!",
      "I'm a fan of Thai flavors, and this red curry hit the mark. The shrimp were perfectly cooked.",
      "Authentic Thai taste! The blend of spices in this red curry is fantastic."
    ]
  },
  "7": {
    "comments": [
      "The lemon and garlic combination is heavenly. The salmon comes out so flavorful and crispy!",
      "Crispy Lemon Garlic Salmon is a regular on my dinner menu now. The flavors are outstanding.",
      "A delightful recipe! The salmon was perfectly cooked and the garlic-lemon blend was just right."
    ]
  },
  "8": {
    "comments": [
      "Spicy Vegetable Jambalaya is a hit in our household. The heat and medley of veggies make it so tasty.",
      "Love the kick of spice in this jambalaya. The vegetables maintain their crunch, which I appreciate.",
      "A flavorful and hearty dish. The spices really bring it to life. Great for gatherings!"
    ]
  },
  "9": {
    "comments": [
      "Greek Salad is my go-to for a light and refreshing side. The feta adds the perfect tanginess.",
      "Healthy and delicious! Greek Salad is a must-have with any Mediterranean meal.",
      "Simple, yet so flavorful. The olives and feta make this salad a standout."
    ]
  },
  "10": {
    "comments": [
      "Classic Margherita Pizza is a timeless favorite. The simplicity of ingredients lets the flavors shine.",
      "This Margherita pizza recipe is just like the ones I had in Italy. Absolutely divine!",
      "Perfectly crispy crust and the fresh basil on top... this Margherita pizza is a winner."
    ]
  },
  "11": {
    "comments": [
      "Beef Tacos are a family favorite. The seasoning is perfect, and they're so customizable!",
      "These beef tacos are a hit at our gatherings. The flavors and textures are a crowd-pleaser.",
      "Tacos are always a good idea, and this recipe delivers on taste. The beef is juicy and well-seasoned."
    ]
  },
  "12": {
    "comments": [
      "Vegetarian Sushi Rolls are a delight. A fun recipe to make, and they taste amazing!",
      "Making sushi rolls at home has never been easier. These vegetarian ones are my new favorite.",
      "Delicious and satisfying. The variety of veggies adds a burst of flavor to each bite."
    ]
  },
  "13": {
    "comments": [
      "Chicken Katsu Curry is a comforting dish. The crispy chicken and the curry sauce are a perfect match.",
      "The chicken was crispy and the curry sauce was heavenly. A must-try for Japanese cuisine lovers.",
      "Perfectly fried chicken with a rich curry sauce. This recipe is a keeper for sure."
    ]
  },
  "14": {
    "comments": [
      "Adobo Chicken is a Filipino classic. The vinegar and soy sauce marinade is so flavorful!",
      "Being Filipino, I know Adobo well, and this recipe hits the mark. The flavors are authentic.",
      "This Adobo Chicken recipe brought me back to my mom's cooking. Absolutely delicious!"
    ]
  },
  "15": {
    "comments": [
      "Pancit Canton is a Filipino favorite and this recipe did not disappoint. So much flavor and variety of ingredients!",
      "Delicious and satisfying! Pancit Canton is a go-to comfort food and this recipe nailed it.",
      "A taste of the Philippines! Pancit Canton is now a regular dish in my home."
    ]
  },
  "16": {
    "comments": [
      "Halo-Halo is a delightful dessert. The mix of ingredients creates a burst of flavors and textures.",
      "A taste of the Philippines! Halo-Halo is a unique dessert and this recipe captured it perfectly.",
      "Halo-Halo is a must-try. The combination of sweet fruits and jellies is absolutely delicious!"
    ]
  },
  "17": {
    "comments": [
      "Pad Thai is a classic Thai dish, and this recipe is on point. The flavors are authentic and delicious.",
      "Love the blend of sweet, salty, and tangy in this Pad Thai. Better than takeout!",
      "Authentic and flavorful. This Pad Thai recipe is now a favorite in our household."
    ]
  },
  "18": {
    "comments": [
      "Tom Yum Goong is a spicy and sour delight. The flavors of lemongrass and shrimp really shine through.",
      "Spicy and aromatic! Tom Yum Goong is a Thai soup favorite and this recipe delivered.",
      "Authentic Tom Yum Goong! The perfect balance of spice and sourness makes this soup exceptional."
    ]
  },
  "19": {
    "comments": [
      "Green Curry Chicken is a Thai classic. The blend of herbs and spices in this recipe is exceptional.",
      "Absolutely loved this green curry. The chicken was tender and the sauce was rich and creamy.",
      "Green Curry Chicken is a favorite, and this recipe did not disappoint. The flavors were spot-on."
    ]
  },
  "20": {
    "comments": [
      "Mohinga is a Burmese gem. The flavors are unique and delightful. A must-try for any food enthusiast!",
      "A taste of Myanmar! Mohinga is a unique and flavorful dish, and this recipe captured it perfectly.",
      "Authentic Mohinga that brought back memories of my travels. The flavors were spot-on!"
    ]
  },
  "21": {
    "comments": [
      "Burmese Tea Leaf Salad is a burst of flavors and textures. The crunch and tanginess make it a winner.",
      "Loved the crunch of the tea leaves and the unique flavors. Burmese Tea Leaf Salad is now a favorite in my house!",
      "The Burmese Tea Leaf Salad is a must-try. The mix of flavors and textures is truly extraordinary."
    ]
  },
  "22": {
    "comments": [
      "Burmese Chicken Curry is comfort food at its finest. The blend of spices and tender chicken is heavenly.",
      "A taste of Burma in my kitchen! This Burmese Chicken Curry is now a family favorite.",
      "Incredible flavors! The Burmese Chicken Curry was a hit. Definitely making it again."
    ]
  },
  "23": {
    "comments": [
      "Bibimbap is a Korean classic, and this recipe lived up to its reputation. So delicious and satisfying!",
      "I love Korean cuisine, and this Bibimbap was exceptional. The combination of flavors and textures was perfect.",
      "Bibimbap is always a treat, and this recipe did not disappoint. The spicy sauce really brought it all together."
    ]
  },
  "24": {
    "comments": [
      "Kimchi Jjigae is a comforting Korean stew, and this recipe was amazing. The flavors were authentic and bold.",
      "A bowl of warmth and flavor. The Kimchi Jjigae was comforting and had a nice kick.",
      "Being a kimchi lover, this Kimchi Jjigae was a delight. Spicy and full of goodness."
    ]
  },
  "25": {
    "comments": [
      "Korean Fried Chicken is a guilty pleasure, and this recipe nailed it. Crispy, juicy, and oh-so-delicious!",
      "A taste of Korea! The Korean Fried Chicken was addictive. I couldn't stop eating it.",
      "The Korean Fried Chicken was a hit at my gathering. Crispy and packed with flavor."
    ]
  },
  "26": {
    "comments": [
      "Beef Noodle Soup is a comfort food classic. This recipe hit the spot!",
      "Satisfying and hearty. The beef in this noodle soup was tender and delicious.",
      "A steaming bowl of goodness! This Beef Noodle Soup is a winner for me."
    ]
  },
  "27": {
    "comments": [
      "Oyster Omelette is a unique street food favorite, and this recipe captured its essence. Authentic and tasty!",
      "A taste of Asia! The Oyster Omelette was so flavorful and satisfying. A must-try street food experience at home.",
      "Oyster Omelette is a unique dish, and this recipe was a hit. The mix of textures was amazing."
    ]
  },
  "28": {
    "comments": [
      "Bubble Milk Tea is a delightful treat. This recipe is as good as the ones from my favorite bubble tea shop!",
      "Love the bubbles and the creamy tea. Making Bubble Milk Tea at home is a game-changer.",
      "Bubble Milk Tea is a guilty pleasure, and this homemade version exceeded my expectations. Delicious!"
    ]
  },
  "29": {
    "comments": [
      "Nasi Lemak is a Malaysian favorite, and this recipe was fantastic. The sambal was on point!",
      "A taste of Malaysia! The Nasi Lemak was a hit at my dinner table. The flavors were amazing.",
      "Nasi Lemak is a dish close to my heart, and this recipe did it justice. Perfectly fragrant and tasty."
    ]
  },
  "30": {
    "comments": [
      "Roti Canai is a Malaysian delight, and this recipe captured its essence. Flaky, crispy, and so good!",
      "Authentic and delicious. The Roti Canai was a hit in my household. Will definitely make it again.",
      "Roti Canai brings back memories of Malaysia. This recipe was a success, and the dipping sauce was amazing!"
    ]
  },
  "31": {
    "comments": [
      "Laksa is a Malaysian favorite, and this recipe nailed it. The creamy broth and the spice blend were perfect!",
      "Deliciously spicy and creamy. Laksa is a favorite, and this recipe is now at the top of my list.",
      "Laksa is a must-try for anyone into Asian cuisine. This recipe was authentic and full of flavor."
    ]
  },
  "32": {
    "comments": [
      "Satay is a classic Indonesian dish, and this recipe did not disappoint. The peanut sauce was heavenly!",
      "Absolutely loved the flavors. Satay is always a hit, and this recipe was a success.",
      "A taste of Indonesia! The Satay was tender and flavorful. The peanut sauce was the perfect accompaniment."
    ]
  },
  "33": {
    "comments": [
      "Sinigang is a Filipino favorite, and this recipe brought back memories of home. The perfect balance of sourness!",
      "Sinigang is a comfort food for me, and this recipe did it justice. The sourness was just right.",
      "Perfectly sour and savory. Sinigang is a dish I grew up with, and this recipe hit all the right notes."
    ]
  },
  "34": {
    "comments": [
      "Huli Huli Chicken is a Hawaiian delight, and this recipe captured the flavors beautifully. Sweet and tangy perfection!",
      "The marinade for the Huli Huli Chicken was amazing. It was a hit at our barbecue!",
      "A taste of Hawaii! The Huli Huli Chicken was flavorful and juicy. Definitely making this again."
    ]
  },
  "35": {
    "comments": [
      "Lomi Lomi Salmon is a Hawaiian classic, and this recipe was a hit. The flavors were spot-on!",
      "A taste of Hawaii! Lomi Lomi Salmon is a favorite, and this recipe didn't disappoint.",
      "Authentic and delicious. Lomi Lomi Salmon is a must-try, and this recipe was a success."
    ]
  },
  "36": {
    "comments": [
      "Pineapple Coconut Smoothie is a tropical delight. Refreshing and perfect for a hot day!",
      "Love the combination of pineapple and coconut. This smoothie is now a staple in my morning routine.",
      "Pineapple Coconut Smoothie is a burst of tropical flavors. So delicious and refreshing!"
    ]
  },
  "37": {
    "comments": [
      "Tempura is a guilty pleasure, and this recipe nailed the crispy perfection. Loved the dipping sauce!",
      "Crispy and delightful! Tempura is a favorite, and this recipe hit the mark.",
      "A taste of Japan. The Tempura was light, crispy, and full of flavor. Will definitely make it again."
    ]
  },
  "38": {
    "comments": [
      "Miso Soup is a staple in my diet, and this recipe was authentic and comforting. Love the umami!",
      "Authentic and delicious. Miso Soup is a go-to, and this recipe delivered.",
      "A bowl of warmth and flavor. Miso Soup is a must-have, and this recipe hit all the right notes."
    ]
  },
  "39": {
    "comments": [
      "Tacos al Pastor is a Mexican favorite, and this recipe did it justice. The flavors were incredible!",
      "Tacos al Pastor is a hit in my household, and this recipe was spot-on. The pineapple added a great twist.",
      "Authentic and mouthwatering. Tacos al Pastor is a must-try, and this recipe won't disappoint."
    ]
  },
  "40": {
    "comments": [
      "Guacamole is a classic dip, and this recipe was fantastic. Creamy and full of flavor!",
      "Simple and delicious. Guacamole is always a crowd-pleaser, and this recipe was no exception.",
      "Perfectly ripe avocados and the right blend of ingredients. This Guacamole is a winner."
    ]
  },
  "41": {
    "comments": [
      "Enchiladas Rojas are a Mexican classic, and this recipe was fantastic. The sauce was the highlight!",
      "A taste of Mexico! The Enchiladas Rojas were flavorful and satisfying. Perfect for a family dinner.",
      "Delicious and comforting. Enchiladas Rojas are a hit, and this recipe is one I'll keep coming back to."
    ]
  },
  "42": {
    "comments": [
      "Lomo Saltado is a favorite Peruvian dish, and this recipe captured the essence beautifully. The flavors were amazing!",
      "A taste of Peru! The Lomo Saltado was packed with flavor and had the right amount of kick.",
      "Authentic and delicious. Lomo Saltado is a must-try, and this recipe did not disappoint."
    ]
  },
  "43": {
    "comments": [
      "Ceviche is a refreshing and flavorful dish. This recipe was a hit at my summer party!",
      "Loved the freshness of the ingredients and the tangy marinade. Ceviche is now a regular on my menu.",
      "Ceviche is perfect for a light and refreshing appetizer. This recipe is a keeper."
    ]
  },
  "44": {
    "comments": [
      "Aji de Gallina is a flavorful Peruvian dish. This recipe nailed the taste and texture. A great introduction to Peruvian cuisine!",
      "A taste of Peru! The Aji de Gallina was perfectly spiced and had a great balance of flavors. A culinary adventure for your taste buds.",
      "Authentic and delicious. Aji de Gallina is a must-try for adventurous eaters, and this recipe did not disappoint."
    ]
  },
  "45": {
    "comments": [
      "There is a reason why Doro Wat is the national dish of Ethiopia and one of the most famous of all African dishes – it’s fabulous!",
      "This authentic Doro Wat recipe captures the very best of Ethiopian cooking!",
      "This is a quick version of the original recipe, but it did not disappoint. The magic is in the slow cooked onions."
    ]
  },
  "46": {
    "comments": [
      "Injera is a staple in Ethiopian cuisine, and this recipe was fantastic. The texture and taste were authentic and satisfying.",
      "A taste of Ethiopia! The Injera was just like the ones I had in Ethiopia. Fluffy and perfect for scooping up stews.",
      "Authentic and delicious. Injera is a must-try, and this recipe is a winner."
    ]
  },
  "47": {
    "comments": [
      "Kitfo is a unique and flavorful Ethiopian dish. This recipe nailed the taste and texture. A great introduction to Ethiopian cuisine!",
      "A taste of Ethiopia! The Kitfo was perfectly spiced and had a great balance of flavors. A culinary adventure for your taste buds.",
      "Authentic and delicious. Kitfo is a must-try for adventurous eaters, and this recipe did not disappoint."
    ]
  },
  "48": {
    "comments": [
      "Kimchi Fried Rice is a Korean favorite, and this recipe delivered. The flavors were bold and delicious!",
      "Spicy and satisfying. Kimchi Fried Rice is a go-to for me, and this recipe was exceptional.",
      "A taste of Korea! The Kimchi Fried Rice was packed with flavor and had the right amount of spice."
    ]
  },
  "49": {
    "comments": [
      "Dak Galbi is a Korean delight, and this recipe captured the flavors beautifully. The marinade was fantastic!",
      "A taste of Korea! The Dak Galbi was flavorful and had the perfect level of spice.",
      "Delicious and satisfying. Dak Galbi is a must-try, and this recipe is one I'll be making again."
    ]
  },
  "50": {
    "comments": [
      "Banchan - Spinach Namul is a Korean side dish staple, and this recipe was spot-on. The flavors were perfect!",
      "A taste of Korea! The Banchan - Spinach Namul was simple and delicious. The sesame oil added a great depth of flavor.",
      "Authentic and delicious. Banchan - Spinach Namul is a must-have, and this recipe delivered."
    ]
  },
  "51": {
    "comments": [
      "General Tso's Chicken is a Chinese-American favorite, and this recipe did it justice. The sauce was perfect!",
      "Absolutely loved the flavors. General Tso's Chicken is always a hit, and this recipe was a success.",
      "A taste of China! The General Tso's Chicken was tender and flavorful. The sauce was the perfect accompaniment."
    ]
  },
  "52": {
    "comments": [
      "Egg Drop Soup is a comforting Chinese classic. This recipe is simple yet so flavorful!",
      "Love the simplicity and taste of this Egg Drop Soup. It's my go-to soup on chilly days.",
      "Authentic and delicious. Egg Drop Soup is a must-have, and this recipe hit all the right notes."
    ]
  },
  "53": {
    "comments": [
      "Shrimp Lo Mein is a favorite Chinese takeout dish, and this recipe was spot-on. The flavors were incredible!",
      "Tasted just like my favorite restaurant's Shrimp Lo Mein. This recipe is a keeper.",
      "A taste of China! The Shrimp Lo Mein was packed with flavor and had the right balance of noodles and veggies."
    ]
  },
  "54": {
    "comments": [
      "Mapo Tofu is a spicy and flavorful Chinese dish. This recipe captured the traditional taste beautifully. A must-try for fans of Chinese cuisine!",
      "A taste of China! The Mapo Tofu was rich and aromatic. The blend of spices was perfect.",
      "Authentic and delicious. Mapo Tofu is a favorite, and this recipe lived up to my expectations."
    ]
  },
  "55": {
    "comments": [
      "Dumplings (Jiaozi) are a Chinese favorite, and this recipe delivered. The dipping sauce was amazing!",
      "Love making dumplings at home, and this recipe made it so easy. They turned out delicious!",
      "A taste of China! The Dumplings (Jiaozi) were perfectly cooked and had a tasty filling. Great for sharing with friends."
    ]
  },
  "56": {
    "comments": [
      "Egg Fried Rice is a Chinese classic, and this recipe was fantastic. The rice was perfectly fried and the flavors were amazing!",
      "Egg Fried Rice is a comfort food favorite, and this recipe hit the mark. It's now a regular in my meal rotation.",
      "A taste of China! The Egg Fried Rice was flavorful and had the right balance of ingredients."
    ]
  },
  "57": {
    "comments": [
      "Caponata is a Sicilian delight. The mix of eggplant and olives creates a burst of flavors and textures.",
      "Loved the combination of ingredients and the richness of the flavors. Caponata is now a regular on my menu.",
      "Caponata is a must-try. The mix of sweet, sour, and savory flavors is absolutely delicious!"
    ]
  },
  "58": {
    "comments": [
      "Pho Bo is a Vietnamese classic, and this recipe is on point. The flavors are authentic and delicious.",
      "Love the blend of sweet, salty, and savory in this Pho Bo. Better than takeout!",
      "Authentic and flavorful. This Pho Bo recipe is now a favorite in our household."
    ]
  },
  "59": {
    "comments": [
      "Fresh Spring Rolls (Goi Cuon) are a Vietnamese favorite, and this recipe nailed it. The peanut sauce was amazing!",
      "Absolutely loved the flavors. Fresh Spring Rolls (Goi Cuon) are a hit in my household, and this recipe was a success.",
      "A taste of Vietnam! The Fresh Spring Rolls (Goi Cuon) were so fresh and delicious. The peanut sauce was the perfect accompaniment."
    ]
  },
  "60": {
    "comments": [
      "Ca Kho To is a Vietnamese delight, and this recipe captured the flavors beautifully. Sweet and savory perfection!",
      "The caramelization in this Ca Kho To was amazing. It was a hit at our family gathering!",
      "A taste of Vietnam! The Ca Kho To was flavorful and had the right balance of sweetness and umami. Definitely making this again."
    ]
  },
  "61": {
    "comments": [
      "Hainanese Chicken Rice is a Singaporean favorite, and this recipe did it justice. The chicken was tender and flavorful!",
      "A taste of Singapore! The Hainanese Chicken Rice was authentic and absolutely delicious.",
      "Hainanese Chicken Rice is a must-try. The chicken was perfectly cooked and the accompanying sauces were on point."
    ]
  },
  "62": {
    "comments": [
      "Chili Crab is a Singaporean delight, and this recipe captured the flavors beautifully. The sauce was finger-licking good!",
      "A taste of Singapore! The Chili Crab was flavorful and had the right amount of spice. Definitely a crowd-pleaser.",
      "Delicious and satisfying. Chili Crab is a must-try, and this recipe is one I'll be making again."
    ]
  },
  "63": {
    "comments": [
      "Momos are a Nepali favorite, and this recipe captured the flavors beautifully. The dipping sauce was amazing!",
      "A taste of Nepal! The Momos were flavorful and had the perfect balance of spices. Great for gatherings.",
      "Authentic and delicious. Momos are a must-try, and this recipe is one I'll keep coming back to."
    ]
  },
  "64": {
    "comments": [
      "Aloo Tama is a unique Nepali dish. This recipe nailed the taste and texture. A great introduction to Nepali cuisine!",
      "A taste of Nepal! The Aloo Tama was perfectly spiced and had a great balance of flavors. A culinary adventure for your taste buds.",
      "Authentic and delicious. Aloo Tama is a must-try for adventurous eaters, and this recipe did not disappoint."
    ]
  },
  "65": {
    "comments": [
      "Teriyaki Burger is a fusion delight, and this recipe captured the flavors beautifully. Sweet and savory perfection!",
      "The teriyaki sauce in this Teriyaki Burger was amazing. It was a hit at our barbecue!",
      "A taste of fusion! The Teriyaki Burger was flavorful and had the right balance of sweetness and umami. Definitely making this again."
    ]
  },
  "66": {
    "comments": [
      "California Roll Salad is a refreshing twist on a classic sushi favorite. Love the flavors and textures!",
      "I'm a fan of sushi, and this California Roll Salad was a hit. It's a light and tasty option.",
      "Authentic flavors in a salad. The California Roll Salad is a unique and delightful dish."
    ]
  },
  "67": {
    "comments": [
      "Miso Maple Glazed Salmon is a fusion delight, and this recipe captured the flavors beautifully. Sweet and savory perfection!",
      "The glaze for this Miso Maple Glazed Salmon was amazing. It was a hit at our family gathering!",
      "A taste of fusion! The Miso Maple Glazed Salmon was flavorful and had the right balance of sweetness and umami. Definitely making this again."
    ]
  },
  "68": {
    "comments": [
      "Kimchi Grilled Cheese Sandwich is a fusion delight, and this recipe captured the flavors beautifully. Spicy and cheesy goodness!",
      "A unique take on a classic grilled cheese. The Kimchi Grilled Cheese Sandwich was a hit in my household.",
      "A taste of fusion! The Kimchi Grilled Cheese Sandwich was a creative and delicious twist. Definitely making this again."
    ]
  },
  "69": {
    "comments": [
      "Bulgogi Tacos are a fusion delight, and this recipe captured the flavors beautifully. The marinade was fantastic!",
      "The blend of Korean flavors in these Bulgogi Tacos was amazing. They were a hit at our dinner party!",
      "A taste of fusion! The Bulgogi Tacos were flavorful and had the perfect level of spice. Definitely making this again."
    ]
  },
  "70": {
    "comments": [
      "Korean BBQ Pizza is a fusion delight, and this recipe captured the flavors beautifully. The blend of Korean BBQ sauce and cheese was fantastic!",
      "The Korean BBQ sauce on this pizza was amazing. It was a hit at our family gathering!",
      "A taste of fusion! The Korean BBQ Pizza was flavorful and had the right balance of sweetness and spice. Definitely making this again."
    ]
  },
  "71": {
    "comments": [
      "Matzo Ball Soup is a Jewish classic, and this recipe is on point. The matzo balls were light and fluffy, just like Grandma used to make!",
      "I love a good Matzo Ball Soup, and this recipe was a hit. The flavors and textures were spot-on.",
      "Matzo Ball Soup is a comfort food favorite, and this recipe did not disappoint. The matzo balls were perfection."
    ]
  },
  "72": {
    "comments": [
      "Brisket with Kugel is a Jewish delight, and this recipe captured the flavors beautifully. The brisket was tender and the kugel was just like Bubbe used to make!",
      "A taste of tradition! The Brisket with Kugel was flavorful and had the right balance of savory and sweet.",
      "Delicious and satisfying. Brisket with Kugel is a must-try, and this recipe is one I'll keep coming back to."
    ]
  },
  "73": {
    "comments": [
      "Rugelach is a Jewish classic, and this recipe nailed it. The dough was flaky and the filling was sweet and nutty!",
      "I grew up with Rugelach, and this recipe brought back memories. It's now a holiday staple in my household.",
      "Rugelach is a nostalgic treat for me, and this recipe did it justice. Perfectly bite-sized and delicious."
    ]
  },
  "74": {
    "comments": [
      "Mango Sticky Rice is a Thai dessert favorite, and this recipe captured the flavors beautifully. Sweet and creamy perfection!",
      "A taste of Thailand! The Mango Sticky Rice was flavorful and had the right balance of sweetness and creaminess.",
      "Delicious and satisfying. Mango Sticky Rice is a must-try, and this recipe is one I'll be making again."
    ]
  },
  "75": {
    "comments": [
      "Chocolate Lava Cake is a dessert favorite, and this recipe nailed it. The oozing chocolate center was the best part!",
      "I'm a chocolate lover, and this Chocolate Lava Cake was a hit. It's rich, decadent, and oh-so-delicious.",
      "Chocolate Lava Cake is a go-to dessert, and this recipe was perfection. The gooey center was heavenly."
    ]
  },
  "76": {
    "comments": [
      "Strawberry Cheesecake is a classic dessert, and this recipe captured the flavors beautifully. Creamy and fruity goodness!",
      "The strawberry topping on this Strawberry Cheesecake was amazing. It was a hit at our family gathering!",
      "A taste of classic dessert! The Strawberry Cheesecake was flavorful and had the perfect balance of creamy and fruity. Definitely making this again."
    ]
  },
  "77": {
    "comments": [
      "Blueberry Pancakes are a breakfast favorite, and this recipe nailed it. Fluffy and packed with blueberries!",
      "A breakfast delight! The Blueberry Pancakes were light, fluffy, and bursting with blueberry goodness. A hit with the family!",
      "Blueberry Pancakes are a must-try for any breakfast lover, and this recipe delivered. Perfectly golden and delicious."
    ]
  },
  "78": {
    "comments": [
      "Avocado Toast is a breakfast favorite, and this recipe did it justice. The avocado was creamy and the toppings were just right!",
      "A taste of the trend! The Avocado Toast was flavorful and had the perfect balance of creamy avocado and crunchy toppings.",
      "Avocado Toast is a go-to breakfast for me, and this recipe is one I'll keep coming back to. So simple yet delicious."
    ]
  },
  "79": {
    "comments": [
      "Greek Yogurt Parfait is a healthy and delicious breakfast or snack. Loved the layers of yogurt, fruits, and granola!",
      "A healthy treat! The Greek Yogurt Parfait was refreshing and had the right balance of textures and flavors.",
      "Greek Yogurt Parfait is a must-try for a nutritious snack, and this recipe did not disappoint. Perfectly satisfying."
    ]
  },
  "80": {
    "comments": [
      "Butternut Squash Soup is a fall favorite, and this recipe nailed it. Creamy and full of autumn flavors!",
      "A taste of fall! The Butternut Squash Soup was flavorful and had the right balance of sweetness and warmth. Perfect for cozy evenings.",
      "Butternut Squash Soup is a must-try for the fall season, and this recipe is one I'll be making again. Comfort in a bowl!"
    ]
  },
  "81": {
    "comments": [
      "Apple Crisp is a classic dessert, and this recipe captured the flavors beautifully. Sweet and spiced to perfection!",
      "The apple filling in this Apple Crisp was amazing. It was a hit at our family gathering!",
      "A taste of classic dessert! The Apple Crisp was flavorful and had the right balance of sweetness and crunch. Definitely making this again."
    ]
  },
  "82": {
    "comments": [
      "Hearty Beef Stew is a comforting classic, and this recipe did it justice. The meat was tender and the flavors were spot-on!",
      "A taste of comfort! The Hearty Beef Stew was flavorful and had the right balance of vegetables and meat. Perfect for a chilly day.",
      "Hearty Beef Stew is a must-try for any comfort food lover, and this recipe is one I'll keep coming back to. It's the epitome of cozy."
    ]
  },
  "83": {
    "comments": [
      "Creamy Mushroom Risotto is a comforting Italian favorite, and this recipe nailed it. The rice was perfectly cooked and the flavors were amazing!",
      "Risotto is a favorite, and this Creamy Mushroom Risotto was exceptional. Creamy, rich, and full of umami flavors.",
      "Creamy Mushroom Risotto is a must-try for any Italian cuisine enthusiast, and this recipe did not disappoint. Pure comfort on a plate!"
    ]
  },
  "84": {
    "comments": [
      "Meat Pie (Tourtière) is a Canadian classic, and this recipe captured the flavors beautifully. Savory and delicious!",
      "A taste of Canada! The Meat Pie (Tourtière) was flavorful and had the right balance of spices. Perfect for a holiday meal.",
      "Meat Pie (Tourtière) is a must-try Canadian dish, and this recipe is one I'll be making again. Comforting and festive."
    ]
  },
  "85": {
    "comments": [
      "Coq au Vin is a classic French dish, and this recipe nailed it. The chicken was tender and the wine sauce was amazing!",
      "A taste of France! The Coq au Vin was flavorful and had the right balance of rich flavors. Perfect for a special occasion.",
      "Coq au Vin is a must-try French dish, and this recipe is one I'll be making again. It's the epitome of French culinary excellence."
    ]
  },
  "86": {
    "comments": [
      "Ratatouille is a classic French dish, and this recipe captured the flavors beautifully. The medley of vegetables was delightful!",
      "A taste of France! The Ratatouille was flavorful and had the right balance of textures. Perfect for a summer meal.",
      "Ratatouille is a must-try French dish, and this recipe is one I'll keep coming back to. It's a celebration of seasonal produce."
    ]
  },
  "87": {
    "comments": [
      "Croque Monsieur is a French classic, and this recipe nailed it. The ham and cheese were perfectly melted and the bread was golden and crispy!",
      "A taste of France! The Croque Monsieur was flavorful and had the right balance of creaminess and savory goodness. Perfect for a brunch.",
      "Croque Monsieur is a must-try French dish, and this recipe is one I'll be making again. It's a simple yet luxurious delight."
    ]
  },
  "88": {
    "comments": [
      "Crème Brûlée is a classic French dessert, and this recipe captured the flavors beautifully. The caramelized top was the best part!",
      "A taste of France! The Crème Brûlée was flavorful and had the right balance of creaminess and caramelized goodness. A perfect way to end a meal.",
      "Crème Brûlée is a must-try French dessert, and this recipe is one I'll be making again. It's a luxurious and indulgent treat."
    ]
  }
}
