{
  "0": {
    "comments": [
      "Refreshing and packed with nutrients. A great way to start the day!",
      "Love the vibrant color and taste. A go-to detox recipe for me.",
      "Not a fan of green smoothies, but this one pleasantly surprised me. Might become a part of my routine."
    ]
  },
  "1": {
    "comments": [
      "A perfect balance of flavors and textures. A satisfying and wholesome meal.",
      "Buddha bowls are my favorite, and this one exceeded my expectations. Will be a regular on my menu.",
      "Simple, yet so flavorful. I'm impressed with the quinoa and chickpea combination."
    ]
  },
  "2": {
    "comments": [
      "Juicy and flavorful! The lemon herb marinade really makes a difference.",
      "The chicken was tender and had a nice citrusy kick. A hit with my family.",
      "Easy to make, and the taste is outstanding. Will definitely make it again!"
    ]
  },
  "3": {
    "comments": [
      "A hearty and comforting dish. The lentils and spices blend so well together.",
      "Being a vegetarian, this curry is a staple for me. Full of protein and absolutely delicious.",
      "Fantastic flavors! I'll be making this often. It's become a favorite in our household."
    ]
  },
  "4": {
    "comments": [
      "A classic done right. Layers of rich flavors and cheesy goodness. A family favorite!",
      "Deliciously comforting. The perfect lasagna for a cozy dinner at home.",
      "Mouthwatering and filling. This recipe takes lasagna to a whole new level!"
    ]
  },
  "5": {
    "comments": [
      "Spicy, savory, and the shrimp were cooked to perfection. A Thai cuisine lover's delight!",
      "Absolutely loved it! The balance of flavors and textures was amazing. Will be making it again soon.",
      "Thai red curry is my go-to, and this recipe didn't disappoint. Restaurant-quality taste!"
    ]
  },
  "6": {
    "comments": [
      "Crispy on the outside, tender on the inside. The lemon and garlic flavor was spot-on.",
      "A delightful salmon dish. The lemon and garlic combination is a winner!",
      "Perfectly crispy salmon with a burst of lemon and garlic. My taste buds are happy!"
    ]
  },
  "7": {
    "comments": [
      "A spicy and hearty dish that's now in my regular rotation. Love the medley of vegetables!",
      "This jambalaya has a great kick! The flavors are amazing and satisfying.",
      "A great way to spice up my meals. I'll definitely be making this again!"
    ]
  },
  "8": {
    "comments": [
      "Fresh and vibrant! The feta and olives really add a wonderful punch of flavor.",
      "A classic Greek salad done right. Simple, yet so tasty. Perfect for a light lunch.",
      "Love the crunch of the cucumbers and the tanginess of the dressing. A refreshing salad!"
    ]
  },
  "9": {
    "comments": [
      "A simple and classic favorite. The combination of tomato, basil, and mozzarella is always a winner.",
      "Authentic and delicious. This Margherita pizza reminds me of Italy. Definitely making it again!",
      "Perfectly balanced flavors. The basil really shines through. A pizza that never gets old."
    ]
  },
  "10": {
    "comments": [
      "These beef tacos are a crowd-pleaser! The seasoning was on point.",
      "Tasty and easy to make. These tacos are a hit at family gatherings.",
      "Flavorful and satisfying. Definitely making these again for taco night!"
    ]
  },
  "11": {
    "comments": [
      "Love making my own sushi, and this recipe made it a breeze. The taste was exceptional!",
      "Fresh and delicious. Making vegetarian sushi rolls at home is so rewarding!",
      "A fun and healthy recipe. These vegetarian sushi rolls were a hit with my friends."
    ]
  },
  "12": {
    "comments": [
      "A comforting and flavorful dish. The chicken was perfectly crispy, and the curry sauce was heavenly.",
      "Chicken Katsu Curry is a favorite in my household, and this recipe lived up to our expectations. Simply amazing!",
      "One of the best Chicken Katsu Curry recipes I've tried. The flavors are fantastic, and it's surprisingly easy to make."
    ]
  },
  "13": {
    "comments": [
      "Adobo chicken is a Filipino classic, and this recipe nailed it. The flavors were just right!",
      "Being Filipino, I have high expectations for Adobo, and this recipe delivered. So tasty!",
      "A delicious rendition of Adobo chicken. The marinade was perfect, and the chicken was tender and flavorful."
    ]
  },
  "14": {
    "comments": [
      "A Filipino favorite that never disappoints. Packed with flavor and great for gatherings.",
      "This Pancit Canton recipe is on point! The noodles were perfectly cooked, and the flavors were amazing.",
      "Loved the mix of flavors and textures. This Pancit Canton brought back memories of family gatherings."
    ]
  },
  "15": {
    "comments": [
      "Halo-Halo is a refreshing and delightful dessert. Perfect for a hot day!",
      "A taste of the Philippines! Halo-Halo brings back childhood memories. So many different textures and flavors.",
      "A medley of flavors in one bowl. Halo-Halo is a unique and delicious treat. Highly recommend trying it!"
    ]
  },
  "16": {
    "comments": [
      "A classic Thai dish that's always a hit. The balance of sweet, salty, and tangy was perfect.",
      "Pad Thai is a favorite, and this recipe is top-notch. Better than takeout!",
      "Authentic and delicious. The flavors in this Pad Thai are exceptional. A definite must-try."
    ]
  },
  "17": {
    "comments": [
      "Tom Yum Goong is one of my go-to Thai soups. This recipe was just what I needed. Spicy and flavorful!",
      "A burst of flavors in every spoonful. This Tom Yum Goong is an explosion of Thai taste.",
      "Perfectly spicy and sour. Tom Yum Goong is a comfort food for me, and this recipe nailed it."
    ]
  },
  "18": {
    "comments": [
      "Green Curry Chicken is a staple in my household, and this recipe is a winner. Rich and aromatic!",
      "Absolutely loved this green curry. The chicken was tender, and the flavors were authentic.",
      "Green Curry Chicken is a personal favorite, and this recipe did not disappoint. Creamy and full of flavor."
    ]
  },
  "19": {
    "comments": [
      "Mohinga is a Burmese gem. This recipe captured the essence of the dish perfectly. A must-try for anyone interested in Burmese cuisine.",
      "A taste of Burma! Mohinga is such a unique and flavorful dish. This recipe is the real deal.",
      "Authentic Mohinga that transported me back to my travels in Myanmar. The flavors were spot-on!"
    ]
  },
  "20": {
    "comments": [
      "A burst of flavors and textures in every bite. The Burmese Tea Leaf Salad is a refreshing delight.",
      "Loved the crunch of the tea leaves and the unique flavors. Burmese Tea Leaf Salad is now a favorite in my house!",
      "The Burmese Tea Leaf Salad is a must-try. The mix of flavors and textures is truly extraordinary."
    ]
  },
  "21": {
    "comments": [
      "Burmese Chicken Curry is comfort food at its finest. The blend of spices and tender chicken is heavenly.",
      "A taste of Burma in my kitchen! This Burmese Chicken Curry is now a family favorite.",
      "Incredible flavors! The Burmese Chicken Curry was a hit. Definitely making it again."
    ]
  },
  "22": {
    "comments": [
      "Bibimbap is a Korean classic, and this recipe lived up to its reputation. So delicious and satisfying!",
      "I love Korean cuisine, and this Bibimbap was exceptional. The combination of flavors and textures was perfect.",
      "Bibimbap is always a treat, and this recipe did not disappoint. The spicy sauce really brought it all together."
    ]
  },
  "23": {
    "comments": [
      "Kimchi Jjigae is a comforting Korean stew, and this recipe was amazing. The flavors were authentic and bold.",
      "A bowl of warmth and flavor. The Kimchi Jjigae was comforting and had a nice kick.",
      "Being a kimchi lover, this Kimchi Jjigae was a delight. Spicy and full of goodness."
    ]
  },
  "24": {
    "comments": [
      "Korean Fried Chicken is a guilty pleasure, and this recipe nailed it. Crispy, juicy, and oh-so-delicious!",
      "A taste of Korea! The Korean Fried Chicken was addictive. I couldn't stop eating it.",
      "The Korean Fried Chicken was a hit at my gathering. Crispy and packed with flavor."
    ]
  },
  "25": {
    "comments": [
      "Beef Noodle Soup is a comfort food classic. This recipe hit the spot!",
      "Satisfying and hearty. The beef in this noodle soup was tender and delicious.",
      "A steaming bowl of goodness! This Beef Noodle Soup is a winner for me."
    ]
  },
  "26": {
    "comments": [
      "Oyster Omelette is a street food favorite, and this recipe brought back memories of my travels. Authentic and tasty!",
      "A taste of Asia! The Oyster Omelette was so flavorful and satisfying. A must-try street food experience at home.",
      "Oyster Omelette is a unique dish, and this recipe was a hit. The mix of textures was amazing."
    ]
  },
  "27": {
    "comments": [
      "Bubble Milk Tea is a delightful treat. This recipe is as good as the ones from my favorite bubble tea shop!",
      "Love the bubbles and the creamy tea. Making Bubble Milk Tea at home is a game-changer.",
      "Bubble Milk Tea is a guilty pleasure, and this homemade version exceeded my expectations. Delicious!"
    ]
  },
  "28": {
    "comments": [
      "Nasi Lemak is a Malaysian favorite, and this recipe was fantastic. The sambal was on point!",
      "A taste of Malaysia! The Nasi Lemak was a hit at my dinner table. The flavors were amazing.",
      "Nasi Lemak is a dish close to my heart, and this recipe did it justice. Perfectly fragrant and tasty."
    ]
  },
  "29": {
    "comments": [
      "Roti Canai is a Malaysian delight, and this recipe captured its essence. Flaky, crispy, and so good!",
      "Authentic and delicious. The Roti Canai was a hit in my household. Will definitely make it again.",
      "Roti Canai brings back memories of Malaysia. This recipe was a success, and the dipping sauce was amazing!"
    ]
  },
  "30": {
    "comments": [
      "Laksa is a Malaysian favorite, and this recipe nailed it. The creamy broth and the spice blend were perfect!",
      "Deliciously spicy and creamy. Laksa is a favorite, and this recipe is now at the top of my list.",
      "Laksa is a must-try for anyone into Asian cuisine. This recipe was authentic and full of flavor."
    ]
  },
  "31": {
    "comments": [
      "Satay is a classic Indonesian dish, and this recipe did not disappoint. The peanut sauce was heavenly!",
      "Absolutely loved the flavors. Satay is always a hit, and this recipe was a success.",
      "A taste of Indonesia! The Satay was tender and flavorful. The peanut sauce was the perfect accompaniment."
    ]
  },
  "32": {
    "comments": [
      "Sinigang is a Filipino favorite, and this recipe brought back memories of home. The perfect balance of sourness!",
      "Sinigang is a comfort food for me, and this recipe did it justice. The sourness was just right.",
      "Perfectly sour and savory. Sinigang is a dish I grew up with, and this recipe hit all the right notes."
    ]
  },
  "33": {
    "comments": [
      "Huli Huli Chicken is a Hawaiian delight, and this recipe captured the flavors beautifully. Sweet and tangy perfection!",
      "The marinade for the Huli Huli Chicken was amazing. It was a hit at our barbecue!",
      "A taste of Hawaii! The Huli Huli Chicken was flavorful and juicy. Definitely making this again."
    ]
  },
  "34": {
    "comments": [
      "Lomi Lomi Salmon is a Hawaiian classic, and this recipe was a hit. The flavors were spot-on!",
      "A taste of Hawaii! Lomi Lomi Salmon is a favorite, and this recipe didn't disappoint.",
      "Authentic and delicious. Lomi Lomi Salmon is a must-try, and this recipe was a success."
    ]
  },
  "35": {
    "comments": [
      "Pineapple Coconut Smoothie is a tropical delight. Refreshing and perfect for a hot day!",
      "Love the combination of pineapple and coconut. This smoothie is now a staple in my morning routine.",
      "Pineapple Coconut Smoothie is a burst of tropical flavors. So delicious and refreshing!"
    ]
  },
  "36": {
    "comments": [
      "Tempura is a guilty pleasure, and this recipe nailed the crispy perfection. Loved the dipping sauce!",
      "Crispy and delightful! Tempura is a favorite, and this recipe hit the mark.",
      "A taste of Japan. The Tempura was light, crispy, and full of flavor. Will definitely make it again."
    ]
  },
  "37": {
    "comments": [
      "Miso Soup is a staple in my diet, and this recipe was authentic and comforting. Love the umami!",
      "Authentic and delicious. Miso Soup is a go-to, and this recipe delivered.",
      "A bowl of warmth and flavor. Miso Soup is a must-have, and this recipe hit all the right notes."
    ]
  },
  "38": {
    "comments": [
      "Tacos al Pastor is a Mexican favorite, and this recipe did it justice. The flavors were incredible!",
      "Tacos al Pastor is a hit in my household, and this recipe was spot-on. The pineapple added a great twist.",
      "Authentic and mouthwatering. Tacos al Pastor is a must-try, and this recipe won't disappoint."
    ]
  },
  "39": {
    "comments": [
      "Guacamole is a classic dip, and this recipe was fantastic. Creamy and full of flavor!",
      "Simple and delicious. Guacamole is always a crowd-pleaser, and this recipe was no exception.",
      "Perfectly ripe avocados and the right blend of ingredients. This Guacamole is a winner."
    ]
  },
  "40": {
    "comments": [
      "Enchiladas Rojas are a Mexican classic, and this recipe was fantastic. The sauce was the highlight!",
      "A taste of Mexico! The Enchiladas Rojas were flavorful and satisfying. Perfect for a family dinner.",
      "Delicious and comforting. Enchiladas Rojas are a hit, and this recipe is one I'll keep coming back to."
    ]
  },
  "41": {
    "comments": [
      "Lomo Saltado is a favorite Peruvian dish, and this recipe captured the essence beautifully. The flavors were amazing!",
      "A taste of Peru! The Lomo Saltado was packed with flavor and had the right amount of kick.",
      "Authentic and delicious. Lomo Saltado is a must-try, and this recipe did not disappoint."
    ]
  },
  "42": {
    "comments": [
      "Ceviche is a refreshing and flavorful dish. This recipe was a hit at my summer party!",
      "Loved the freshness of the ingredients and the tangy marinade. Ceviche is now a regular on my menu.",
      "Ceviche is perfect for a light and refreshing appetizer. This recipe is a keeper."
    ]
  },
  "43": { 
    "comments": [
     "I made this because I already had aji amarillo paste sitting in my fridge from a different recipe and I wanted to try it a new way.",
     "This is indeed a creamy and flavorful stew! My family loved it.",
     "I didn't have a blender, so I used a food processor instead. Really great recipe, thanks!"
    ]
  },
  "44": {
    "comments": [
      "Doro Wat is a flavorful Ethiopian stew, and this recipe captured the traditional taste beautifully. A must-try for fans of Ethiopian cuisine!",
      "A taste of Ethiopia! The Doro Wat was rich and aromatic. The blend of spices was perfect.",
      "Authentic and delicious. Doro Wat is a favorite, and this recipe lived up to my expectations."
    ]
  },
  "45": {
    "comments": [
      "Injera is a staple in Ethiopian cuisine, and this recipe was fantastic. The texture and taste were authentic and satisfying.",
      "A taste of Ethiopia! The Injera was just like the ones I had in Ethiopia. Fluffy and perfect for scooping up stews.",
      "Authentic and delicious. Injera is a must-try, and this recipe is a winner."
    ]
  },
  "46": {
    "comments": [
      "Kitfo is a unique and flavorful Ethiopian dish. This recipe nailed the taste and texture. A great introduction to Ethiopian cuisine!",
      "A taste of Ethiopia! The Kitfo was perfectly spiced and had a great balance of flavors. A culinary adventure for your taste buds.",
      "Authentic and delicious. Kitfo is a must-try for adventurous eaters, and this recipe did not disappoint."
    ]
  },
  "47": {
    "comments": [
      "Kimchi Fried Rice is a Korean favorite, and this recipe delivered. The flavors were bold and delicious!",
      "Spicy and satisfying. Kimchi Fried Rice is a go-to for me, and this recipe was exceptional.",
      "A taste of Korea! The Kimchi Fried Rice was packed with flavor and had the right amount of spice."
    ]
  },
  "48": {
    "comments": [
      "Dak Galbi is a Korean delight, and this recipe captured the flavors beautifully. The marinade was fantastic!",
      "A taste of Korea! The Dak Galbi was flavorful and had the perfect level of spice.",
      "Delicious and satisfying. Dak Galbi is a must-try, and this recipe is one I'll be making again."
    ]
  },
  "49": {
    "comments": [
      "Banchan - Spinach Namul is a Korean side dish staple, and this recipe was spot-on. The flavors were perfect!",
      "A taste of Korea! The Banchan - Spinach Namul was simple and delicious. The sesame oil added a great depth of flavor.",
      "Authentic and delicious. Banchan - Spinach Namul is a must-have, and this recipe delivered."
    ]
  }
}
